[
  {
    "title": "Web Development.",
    "body": "I got into it thanks to Ceibal and its program Jóvenes a Programar. I have been always intrigued by how websites work, how are they made and how they can communicate with other services and having the opportunity to do that stuff by myself was mind-blowing at first. After I was done with that I continued learning on my own different technologies; the latest addition to my stack is React.I can finally say I'm comfortable enough with it to tackle whatever project I find in front of me. My main goal right now is to improve my CSS skills, I've been too reliant in Tailwind and that needs to change. I'm also looking at doing some backend projects and implement databases to some ideas I already made like tnz.ID, and elevate them to a complete and powerful web app."
  },
  {
    "title": "UX/UI,",
    "accent": "Adobe Suite.",
    "body": "My oldest hobby. I started using Photoshop when I was 12 years old creating book covers for people on Wattpad, and I've been using it ever since for a lot more. I've used Illustrator before although it's not my biggest strength, I'm still learning new things about it. My latest addition to my stack is Figma, and I love it! I already had used Adobe XD, but I made the switch to Figma once they announced XD won't be supported anymore.I have spent countless hours thinking about how to design a website all in my head and paper, and now I can finally create it and see how it will look like. I'm glad I picked up the habit of designing websites, I do think some developers focus too much on the code and efficiency and often forget about the impact good design can have.Throughout the years I've learned more about user centered design and what actually is a UX designer. Thanks to Jovenes a Programar as well I had the opportunity to learn a little bit about those topics in a Google course hosted on Coursera. I didn't finish it, but I still got some knowledge out of it. This is a field I want to dig in even more, I love design and I want to understand how to make the best ones and help people with it. "
  }
]
