[
  {
    "title": "tenzo.star is officially live!",
    "accent": "Let's celebrate!",
    "body": "I'm so happy to finally share this with you guys, I've been working on this for a while now, and I'm really proud of it. I hope you guys like it, and if you do, please share it with your friends, and if you don't, please share it with your enemies. I'm going to keep working on it, and I'm going to keep you guys updated.",
    "date": "01/10/2024",
    "image": "star",
    "id": "blog-04"
  },
  {
    "title": "Let's welcome 2024,",
    "accent": "with a little challenge",
    "body": "Ah how beautiful, another full revolution around the sun, I hope all of you had a wonderful time these holidays. But now we don't have any time to lose people, let set some goals for this new year, and actually achieveing them. I'm going to start with a little challenge, I'm going to write a blog post every weeek. I'm going to write about my progress, my projects, and my life in general if I feel like it. I also want to do a commit every single day, I want to see my commit history all green, and I encourage you to do the same. The only way to get better is to practice, and the only way to practice is to do it every day. I'm going to start with this challenge, and I hope you join me. Let's make 2024 the best year yet!",
    "date": "01/02/2024",
    "image": "",
    "id": "blog-03"
  },
  {
    "title": "It's coming:",
    "accent": "tenzo.star",
    "body": "Man I got sick of using the same old boring websites to look up my birth chart, and since I'm an astroDev I decided to make my own . It's still in development, but I'm really excited about it. I'm learning a lot of new things. I hope I can finish it soon, so I can share it with you guys. I'm sure you'll love it!",
    "image": "star",
    "date": "12/25/2023",
    "id": "blog-02"
  },
  {
    "title": "Goodbye Learning Camp",
    "accent": "",
    "body": "I learned a lot of new things and met a lot of new and cool people. It was a great introduction to React, we had little projects week by week, and our mentors were always there to help and answer our questions. I had an incredible experience and left wanting to learn more, it really provided me with enough insight to catch up easily with the topics we didn't cover, like TypeScript. I did this website using all the knowledge I got from the camp and I'm really proud of it.",
    "date": "12/20/2023",
    "image": "react",
    "id": "blog-01"
  }
]
